# itgid.info - python 2023

# Напишите код, который заменяет в m9 индексы 3,4 на значения 100, 200. Реализуйте диапазоном. 

# write your code under this line

def f01():
    m9 = [999, 888, 777, 666, 555, 444, 333, 222, 111]
    print(m9)
    m9[3:5] = 100, 200
    print(m9)

f01()




