# itgid.info - python 2023

# Напишите код, который заменяет в m10 индексы 3,4 на значение из list data. Реализуйте диапазоном. 

# write your code under this line

def f01():
    m10 = [999, 888, 777, 666, 555, 444, 333, 222, 111]
    data = [100, 500]
    print(m10)
    m10[3:5] = data
    print(m10)

f01()