# itgid.info - python 2023

# Напишите код, который заменяет в m11 с индексом 1 на число 1000 без удаления исходных данных.
#  Выведите в консоль.

# write your code under this line

def f01():
    m11 = [999, 888]
    print(m11)
    m11.insert(1, 1000)
    print(m11)

f01()