# Task 04
# Создайте переменную f, которая содержит cтроку 'Python 3.1'. C помощью команды print выведите в консоль переменную f.

# write your code under this line

f = 'Python 3.1'

print(f)

