# itgid.info - python 2023
# Task 03
# Напишите функцию f03, которая принимает аргумент переменную и возвращает ее тип

s = 4

def f03(s) :
    return type(s)

result = f03(s)
print(result)