import random

# itgid.info - python 2023
# Task 07
# Напишите функцию f07, которая возвращает значение из переменной a. Обратите внимание, что задача решена - изучите ее.

a = 99 # глобальная переменная 

def f07() :
    a = 100 # локальная переменная
    return a

print(f07())
