# Task 02
# Создайте переменную f, которая содержит число 7777. C помощью команды print выведите в консоль переменную f.

# write your code under this line

f = 7777

print(f)