# Task 05
# Создайте переменную a содержащую число 5 и переменную b равную 7. Выведите в консоль сумму a и b.

# write your code under this line

a = 5
b = 7

c = a + b

print(c)