# Изменение списка указанием индекса
def f01 () :
    bar = [11, 22, 33]
    print (bar)
    bar[0] = 77
    print (bar)

# f01()

# Изменение списка указанием диапазона индексов
def f02 () :
    bar = [11, 22, 33]
    print (bar)
    bar[0:2] = 88, 99 # переписываем индексы 0 и 1
    print (bar)

# f02()

# Изменение списка указанием диапазона индексов
def f03 () :
    bar = [11, 22, 33]
    print (bar)
    # добавил [ ] 
    bar[0:2] = [88, 99] # переписываем индексы 0 и 1
    print (bar)

# f03()

# Изменение списка указанием диапазона индексов - меньшим и большим числом
def f04 () :
    bar = [11, 22, 33]
    print (bar)
    # добавил [ ] 
    bar[0:2] = [88] 
    print (bar)

# f04()

# Вставка в нужный индекс списка, без затирания

def f05() :
    bar = [11, 22, 33]
    print (bar)
    bar.insert(1, 999)
    print (bar)

f05()